demo-output/website/dafoam/ladder-b/B3_work/fixB_SA/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "30000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
21000
(
0.0030283480581534
0.00258970648496523
0.00237030070627128
0.00212366831129254
0.00190916295386842
0.00176531586014956
0.0016803612591548
0.00162974816603091
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform 1e-15;
    }
    topWall
    {
        type            fixedValue;
        value           uniform 1e-15;
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
150
(
0.004211425781
0.01033994369
0.009945430793
0.008769079112
0.008048769087
0.007497927174
0.007062613964
0.006718993187
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            symmetry;
    }
}


// ************************************************************************* //
