demo-output/website/dafoam/ladder-b/B3_work/fixB_SA/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "30000";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.0002189781022;

boundaryField
{
    bottomWall  { type fixedValue; value uniform 0; }
    topWall     { type fixedValue; value uniform 0; }
    inlet       { type fixedValue; value uniform 0.0002189781022; }
    outlet      { type zeroGradient; }
    frontAndBack{ type symmetry; }
}
