demo-output/website/dafoam/ladder-b/B3_work/fixB_SA/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "30000";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
21000
(
131.88310455632
131.164851053165
130.804105384855
130.397402424235
130.042643545682
129.804199467931
129.663170915778
129.579077887473
...
)
;

boundaryField
{
    bottomWall
    {
        type            omegaWallFunction;
        blending        binomial;
        n               2;
        value           nonuniform List<scalar> 
140
(
131.88310455632
131.164851053165
130.804105384855
130.397402424235
130.042643545682
129.804199467931
129.663170915778
129.579077887473
...
)
;
    }
    topWall
    {
        type            omegaWallFunction;
        blending        binomial;
        n               2;
        value           nonuniform List<scalar> 
140
(
107.041055242674
103.999386495847
102.104077638355
101.398127187731
101.438361776226
101.875770236138
102.440823453204
102.945608137397
...
)
;
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
150
(
128.317021303882
35.1539759611541
17.0971262942729
10.5451378140328
7.40830240450433
5.62189350307382
4.48405353560064
3.70160970738169
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            symmetry;
    }
}


// ************************************************************************* //
