demo-output/website/dafoam/ladder-b/B3_work/fixB_SA/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//Ubar            Ubar [ 0 1 -1 0 0 0 0 ] ( 0.72 0 0 );

transportModel  Newtonian;

// ro = 1 kg/m3
// mu = 2e-5 kg/m/s

nu              nu [ 0 2 -1 0 0 0 0 ] 7.299270072992701e-05;//Re_H=13700

// DAFoam-required entries not present in the original benchmark case (B2's
// plain OpenFOAM run never needed them -- DASimpleFoam's DAFoam wrapper
// unconditionally reads Pr/Prt from transportProperties even for a purely
// hydrodynamic incompressible run with no energy equation active). Standard
// air values, matching this lab's own naca0012 DAFoam case
// (work/NACA0012_Airfoil_Incompressible/constant/transportProperties).
// These do not participate in the momentum/turbulence equations actually
// being solved here and cannot change the converged U/p/k/omega field.
Pr              0.7;
Prt             1.0;

// ************************************************************************* //
